EntroMorphic/reflex-os/sdkconfig.defaults.own_entry
# Reflex owns the application entry point.
#
# The independence configuration, plus the one option that has to travel with
# REFLEX_OWN_ENTRY: the Reflex task backend. Both are required — the wrapper
# refuses to compile without either — and they are independent in Kconfig, so
# nothing else pairs them.
#
# This file exists because the configuration behind the entry-point result had
# no recipe. It was assembled by hand into a scratch file outside the repo, so
# the one build that demonstrates Reflex keeping the machine was the one build
# nobody else could reproduce. That is the same gap sdkconfig.defaults.independence
# was written to close, repeated one layer up.
#
# Build it with `make own-entry-build`, which supplies -DREFLEX_OWN_ENTRY=1.

CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_LP_CORE=y
CONFIG_ULP_COPROC_RESERVE_MEM=2048

CONFIG_REFLEX_KERNEL_SCHEDULER=y
CONFIG_REFLEX_RADIO_802154=y

# reflex_task_create files a TCB into the Reflex scheduler instead of calling
# xTaskCreate. Without it, app_main runs on Reflex's scheduler while creating
# its tasks on a FreeRTOS that was never started: not a link error, not a
# crash, just a boot that stops partway with no explanation.
CONFIG_REFLEX_TASK_BACKEND_REFLEX=y

# Coexistence off: this configuration runs 802.15.4 alone.
#
# libcoexist.a is a binary blob: 10,130 bytes and 5 of the image's 19 blob
# symbols. Measured: with coex compiled out the radio initialises,
# reports the right channel and PAN ID, and transmits — but receives nothing,
# twice, against a live peer. The entire difference is the COEX_PTI register:
# ieee802154_ll_disable_coex() writes pti=1/hw_ack=1, the blob writes pti=3/
# hw_ack=8, and writing the latter by hand brought reception straight back.
# reflex_radio_802154.c now programs it, so the blob is not needed here.
#
# Only valid because nothing else uses the radio; the same file refuses this
# combination at compile time if Wi-Fi is also enabled.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n

# Reflex drives the 802.15.4 MAC itself.
#
# ESP-IDF's ieee802154 component leaves the build entirely — the platform
# CMakeLists drops it from REQUIRES — and platform/esp32c6/reflex_802154_mac.c
# programs the peripheral directly, against constants `make soc-bridge` proves
# identical to ESP-IDF's own macros. 0 esp_ieee802154_* symbols remain in the
# image, which is 10,768 bytes smaller.
#
# What remains is RF bring-up, which is Tier D's bedrock and not replaceable
# from any register documentation: esp_phy_enable and esp_btbb_enable sequence
# libphy.a and libbtbb.a, and modem_clock_module_enable is refcounted clock
# gating shared with Wi-Fi and Bluetooth. The blob floor does not move — 48,566
# bytes across 14 symbols either way, because the blob is exactly the part that
# cannot go.
#
# Turned on by default here, and not on a hunch. Two boards, Reflex's MAC on
# both: 10 minutes of continuous traffic with 129 frames received against 128
# sent, zero aborts, zero drops, zero spurious interrupts and the scheduler tick
# steady at 1000 Hz; attribution controlled by silencing the peer, which takes
# rx_done to 0 while transmission continues; and with a shared aura key the mesh
# authenticates end to end — aura_fail=0, rx_discover=5, peers=1, the peer
# registered by address.
#
# This raises the Tier D include count from 1 to 4, recorded as a deliberate
# increase in tools/independence_baseline.json. Counting includes weighs a
# 3,240-line driver that owns the peripheral's state machine the same as a
# one-shot bring-up call; that is the limit of the measure, not a reason to
# pretend the trade is bad.
CONFIG_REFLEX_RADIO_802154_OWN_MAC=y
